package y

var G64 = map[string]*Gua64{
	//乾宫八卦属金：
	//  乾为天　　　  
	//  父母戌土 世 　　　　
	//  兄弟申金 　　　　
	//  官鬼午火 　　　　
	//  父母辰土 应 　　　
	//  妻财寅木 　　　　
	//  子孙子水　　　　　
	"111111": NewGua64(
		"乾",
		1,
		"金", "乾为天", "天",
		"父母戌土世",
		"兄弟申金",
		"官鬼午火",
		"父母辰土应",
		"妻财寅木",
		"子孙子水",
	),
	//-------- -----------------------------
	//  天风姤gòu
	//　父母戌土 
	//　兄弟申金 　　
	//　官鬼午火  应　
	//　兄弟酉金 　　
	//　子孙亥水 　　
	//  父母丑土  世
	"011111": NewGua64(
		"乾",
		2,
		"金",
		"天风姤",
		"姤",
		"父母戌土",
		"兄弟申金",
		"官鬼午火应",
		"兄弟酉金",
		"子孙亥水",
		"父母丑土世",
	),
	//-------天山遁- -----------------------------
	//父母戌土　　
	//兄弟申金 应　　
	//官鬼午火　　　
	//兄弟申金　　　
	//官鬼午火 世　
	//父母辰土 　
	"001111": NewGua64(
		"乾",
		3,
		"金",
		"天山遁",
		"遁",
		"父母戌土",
		"兄弟申金应",
		"官鬼午火",
		"兄弟申金",
		"官鬼午火世",
		"父母辰土",
	),
	//-------- 天地否-----------------------------
	//　父母戌土  应
	//　兄弟申金
	//　官鬼午火
	//　妻财卯木  世
	//　官鬼巳火
	//  父母未土
	"000111": NewGua64(
		"乾",
		4,
		"金",
		"天地否",
		"否",
		"父母戌土应",
		"兄弟申金",
		"官鬼午火",
		"妻财卯木世",
		"官鬼巳火",
		"父母未土",
	),
	//--------风地观 -----------------------------
	//妻财卯木  　
	//官鬼巳火  　
	//父母未土 世
	//妻财卯木 
	//官鬼巳火 
	//父母未土 应
	"000011": NewGua64(
		"乾",
		5,
		"金",
		"风地观",
		"观",
		"妻财卯木",
		"官鬼巳火",
		"父母未土世",
		"妻财卯木",
		"官鬼巳火",
		"父母未土应",
	),

	//----山地剥 ---- -----------------------------
	//妻财寅木  　　
	//子孙子水 世 　
	//父母戌土 
	//妻财卯木 　
	//官鬼巳火  应
	//父母未土 
	"000001": NewGua64(
		"乾",
		6,
		"金",
		"山地剥",
		"剥",
		"妻财寅木",
		"子孙子水世",
		"父母戌土",
		"妻财卯木",
		"官鬼巳火应",
		"父母未土",
	),
	//-----火地晋--- -----------------------------
	//　　 官鬼巳火 　　　　
	//　　 父母未土  　
	//　 兄弟酉金  世　
	//　　 妻财卯木  
	//　  官鬼巳火
	//　 父母未土  应 　
	"000010": NewGua64(
		"乾",
		7,
		"金",
		"火地晋",
		"晋",
		"官鬼巳火",
		"父母未土",
		"兄弟酉金世",
		"妻财卯木",
		"官鬼巳火",
		"父母未土应",
	),
	//-----火天大有--- -----------------------------
	//官鬼巳火  应
	//父母未土
	//兄弟酉金
	//父母辰土  世
	//妻财寅木
	//子孙子水
	"111101": NewGua64(
		"乾",
		8,
		"金",
		"火地晋",
		"晋",
		"官鬼巳火",
		"父母未土",
		"兄弟酉金世",
		"妻财卯木",
		"官鬼巳火",
		"父母未土应",
	),

	//--------兑宫 -----------------------------
	//  兑为泽　　　　
	//父母未土  世 　
	//兄弟酉金  　　　
	//子孙亥水  　　　
	//父母丑土 应　
	//妻财卯木  　　　
	//官鬼巳火  　　
	"110110": NewGua64(
		"兑",
		1,
		"金",
		"兑为泽",
		"泽",
		"父母未土世",
		"兄弟酉金",
		"子孙亥水",
		"父母丑土应",
		"妻财卯木",
		"官鬼巳火",
	),
	//-----泽水困--- -----------------------------
	//  父母未土  
	//　兄弟酉金 　　　
	//　子孙亥水 应　　
	//  官鬼午火
	//　父母辰土 　　　
	//　妻财寅木  世　
	"010110": NewGua64(
		"兑",
		2,
		"金",
		"兑为泽",
		"泽",
		"父母未土",
		"兄弟酉金",
		"子孙亥水应",
		"官鬼午火",
		"父母辰土",
		"妻财寅木世",
	),
	//--------泽地萃 -----------------------------
	//父母未土
	//兄弟酉金 应
	//子孙亥水
	//妻财卯木
	//官鬼巳火世　
	//父母未土
	"000110": NewGua64(
		"兑",
		3,
		"金",
		"泽地萃",
		"萃",
		"父母未土",
		"兄弟酉金应",
		"子孙亥水",
		"妻财卯木",
		"官鬼巳火世",
		"父母未土",
	),
	//-----泽山咸--- -----------------------------
	//父母未土应
	//兄弟酉金
	//子孙亥水
	//兄弟申金世
	//官鬼午火
	//父母辰土
	"001110": NewGua64(
		"兑",
		4,
		"金",
		"泽山咸",
		"咸",
		"父母未土应",
		"兄弟酉金",
		"子孙亥水",
		"兄弟申金世",
		"官鬼午火",
		"父母辰土",
	),


	//--------水山蹇-----------------------------
	//子孙子水 　
	//父母戌土  　　　
	//兄弟申金 世 　
	//兄弟申金  　　　
	//官鬼午火 　
	//父母辰土 应 　
	"001010": NewGua64(
		"兑",
		5,
		"金",
		"水山蹇",
		"蹇",
		"子孙子水",
		"父母戌土",
		"兄弟申金世",
		"兄弟申金",
		"官鬼午火",
		"父母辰土应",
	),
	//------6--地山谦 -----------------------------
	//兄弟酉金
	//子孙亥水 世 　
	//父母丑土 　
	//兄弟申金 　
	// 官鬼午火 应 　
	// 父母辰土 　
	"001000": NewGua64(
		"兑",
		6,
		"金",
		"地山谦",
		"谦",
		"兄弟酉金",
		"子孙亥水世",
		"父母丑土",
		"兄弟申金",
		"官鬼午火应",
		"父母辰土",
	),
	//--------7  雷山小过-----------------------------
	//父母戌土
	//兄弟申金
	//官鬼午火 世　　
	//兄弟申金 　　　
	//官鬼午火 　
	//父母辰土  应　

	"001100": NewGua64(
		"兑",
		7,
		"金",
		"雷山小过",
		"小过",
		"父母戌土",
		"兄弟申金",
		"官鬼午火世",
		"兄弟申金",
		"官鬼午火",
		"父母辰土应",
	),
	//--------8  雷泽归妹-----------------------------
	//父母戌土 应
	//兄弟申金
	//官鬼午火
	//父母丑土 世
	//妻财卯木
	//官鬼巳火
	"111100": NewGua64(
		"兑",
		8,
		"金",
		"雷泽归妹",
		"归妹",
		"父母戌土应",
		"兄弟申金",
		"官鬼午火",
		"父母丑土世",
		"妻财卯木",
		"官鬼巳火",
	),

	//--------//离宫八卦属火： -----------------------------
	//--------1 离为火-----------------------------
	//兄弟巳火  世 　
	//子孙未土   　　　
	//妻财酉金   　　
	//官鬼亥水  应　　
	//子孙丑土    　　
	//父母卯木   　　　
	"101101": NewGua64(
		"离",
		1,
		"火",
		"离为火",
		"火",
		"兄弟巳火世",
		"子孙未土",
		"妻财酉金",
		"官鬼亥水应",
		"子孙丑土",
		"父母卯木",
	),
	//--------2 火山旅-----------------------------
	//兄弟巳火   　
	//子孙未土
	//妻财酉金  应　
	//妻财申金  　　
	//兄弟午火   　
	//子孙辰土   世
	"001101": NewGua64(
		"离",
		2,
		"火",
		"火山旅",
		"旅",
		"兄弟巳火",
		"子孙未土",
		"妻财酉金应",
		"妻财申金",
		"兄弟午火",
		"子孙辰土世",
	),
	//----3----火风鼎-----------------------------
	//兄弟巳火 　　　
	//子孙未土  应
	//妻财酉金 　　　
	//妻财酉金 　　　
	//官鬼亥水  世　
	//子孙丑土   　
	"011101": NewGua64(
		"离",
		3,
		"火",
		"火风鼎",
		"鼎",
		"",
		"兄弟巳火",
		"子孙未土应",
		"妻财酉金",
		"妻财酉金",
		"官鬼亥水世",
		"子孙丑土",
	),
	//-------- 4 火水未济-----------------------------
	//兄弟巳火  应
	//子孙未土
	//妻财酉金
	//兄弟午火   世
	//子孙辰土
	//父母寅木
	"010101": NewGua64(
		"离",
		4,
		"火",
		"火水未济",
		"未济",
		"兄弟巳火应",
		"子孙未土",
		"妻财酉金",
		"兄弟午火世",
		"子孙辰土",
		"父母寅木",
	),

	//-------- --5---------------------------
	//山水蒙 　　　   　
	// 父母寅木   　　　
	// 官鬼子水    　　
	// 子孙戌土   世 　
	// 兄弟午火    　　
	// 子孙辰土   　　　
	// 父母寅木   应 　
	"010001": NewGua64(
		"离",
		5,
		"火",
		"山水蒙",
		"蒙",
		"父母寅木",
		"官鬼子水",
		"子孙戌土世",
		"兄弟午火",
		"子孙辰土",
		"父母寅木应",
	),
	//--------6 -----------------------------
	// 风水涣　　
	// 　 父母卯木   　
	//   兄弟巳火  世
	//   子孙未土
	//   兄弟午火
	// 　子孙辰土  应
	//   父母寅木
	"010011": NewGua64(
		"离",
		6,
		"火",
		"风水涣",
		"涣",
		"父母卯木",
		"兄弟巳火世",
		"子孙未土",
		"兄弟午火",
		"子孙辰土应",
		"父母寅木",
	),
	//--------7 天水讼-----------------------------
	//子孙戌土 　　　　
	//妻财申金 　　　
	//兄弟午火 世 　
	//兄弟午火   　
	//子孙辰土 　　　　
	//父母寅木  应　
	"010111": NewGua64(
		"离",
		7,
		"火",
		"天水讼",
		"讼",
		"子孙戌土",
		"妻财申金",
		"兄弟午火世",
		"兄弟午火",
		"子孙辰土",
		"父母寅木应",
	),
	//-------8- -----------------------------
	//  　天火同人
	//子孙戌土  应
	//妻财申金
	//兄弟午火
	//官鬼亥水  世
	//子孙丑土
	//父母卯木
	"101111": NewGua64(
		"离",
		8,
		"火",
		"天火同人",
		"同人",
		"子孙戌土应",
		"妻财申金",
		"兄弟午火",
		"官鬼亥水世",
		"子孙丑土",
		"父母卯木",
	),

	//========================
	"a": NewGua64(
		"离",
		1,
		"火",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
	),
}
