package y

var G64 = map[string]*Gua64{
	//乾宫八卦属金：
	//  乾为天　　　  
	//  父母戌土 世 　　　　
	//  兄弟申金 　　　　
	//  官鬼午火 　　　　
	//  父母辰土 应 　　　
	//  妻财寅木 　　　　
	//  子孙子水　　　　　
	"111111": NewGua64(
		"乾",
		1,
		"金", "乾为天", "天",
		"父母戌土世",
		"兄弟申金",
		"官鬼午火",
		"父母辰土应",
		"妻财寅木",
		"子孙子水",
	),
	//-------- -----------------------------
	//  天风姤gòu
	//　父母戌土 
	//　兄弟申金 　　
	//　官鬼午火  应　
	//　兄弟酉金 　　
	//　子孙亥水 　　
	//  父母丑土  世
	"011111": NewGua64(
		"乾",
		2,
		"金",
		"天风姤",
		"姤",
		"父母戌土",
		"兄弟申金",
		"官鬼午火应",
		"兄弟酉金",
		"子孙亥水",
		"父母丑土世",
	),
	//-------天山遁- -----------------------------
	//父母戌土　　
	//兄弟申金 应　　
	//官鬼午火　　　
	//兄弟申金　　　
	//官鬼午火 世　
	//父母辰土 　
	"001111": NewGua64(
		"乾",
		3,
		"金",
		"天山遁",
		"遁",
		"父母戌土",
		"兄弟申金应",
		"官鬼午火",
		"兄弟申金",
		"官鬼午火世",
		"父母辰土",
	),
	//-------- 天地否-----------------------------
	//　父母戌土  应
	//　兄弟申金
	//　官鬼午火
	//　妻财卯木  世
	//　官鬼巳火
	//  父母未土
	"000111": NewGua64(
		"乾",
		4,
		"金",
		"天地否",
		"否",
		"父母戌土应",
		"兄弟申金",
		"官鬼午火",
		"妻财卯木世",
		"官鬼巳火",
		"父母未土",
	),
	//--------风地观 -----------------------------
	//妻财卯木  　
	//官鬼巳火  　
	//父母未土 世
	//妻财卯木 
	//官鬼巳火 
	//父母未土 应
	"000011": NewGua64(
		"乾",
		5,
		"金",
		"风地观",
		"观",
		"妻财卯木",
		"官鬼巳火",
		"父母未土世",
		"妻财卯木",
		"官鬼巳火",
		"父母未土应",
	),

	//----山地剥 ---- -----------------------------
	//妻财寅木  　　
	//子孙子水 世 　
	//父母戌土 
	//妻财卯木 　
	//官鬼巳火  应
	//父母未土 
	"000001": NewGua64(
		"乾",
		6,
		"金",
		"山地剥",
		"剥",
		"妻财寅木",
		"子孙子水世",
		"父母戌土",
		"妻财卯木",
		"官鬼巳火应",
		"父母未土",
	),
	//-----火地晋--- -----------------------------
	//　　 官鬼巳火 　　　　
	//　　 父母未土  　
	//　 兄弟酉金  世　
	//　　 妻财卯木  
	//　  官鬼巳火
	//　 父母未土  应 　
	"000101": NewGua64(
		"乾",
		7,
		"金",
		"火地晋",
		"晋",
		"官鬼巳火",
		"父母未土",
		"兄弟酉金世",
		"妻财卯木",
		"官鬼巳火",
		"父母未土应",
	),
	//-----火天大有--- -----------------------------
	//官鬼巳火  应
	//父母未土
	//兄弟酉金
	//父母辰土  世
	//妻财寅木
	//子孙子水
	"111101": NewGua64(
		"乾",
		8,
		"金",
		"火地晋",
		"晋",
		"官鬼巳火",
		"父母未土",
		"兄弟酉金世",
		"妻财卯木",
		"官鬼巳火",
		"父母未土应",
	),

	//--------兑宫 -----------------------------
	//  兑为泽　　　　
	//父母未土  世 　
	//兄弟酉金  　　　
	//子孙亥水  　　　
	//父母丑土 应　
	//妻财卯木  　　　
	//官鬼巳火  　　
	"110110": NewGua64(
		"兑",
		1,
		"金",
		"兑为泽",
		"泽",
		"父母未土世",
		"兄弟酉金",
		"子孙亥水",
		"父母丑土应",
		"妻财卯木",
		"官鬼巳火",
	),
	//-----泽水困--- -----------------------------
	//  父母未土  
	//　兄弟酉金 　　　
	//　子孙亥水 应　　
	//  官鬼午火
	//　父母辰土 　　　
	//　妻财寅木  世　
	"010110": NewGua64(
		"兑",
		2,
		"金",
		"兑为泽",
		"泽",
		"父母未土",
		"兄弟酉金",
		"子孙亥水应",
		"官鬼午火",
		"父母辰土",
		"妻财寅木世",
	),
	//--------泽地萃 -----------------------------
	//父母未土
	//兄弟酉金 应
	//子孙亥水
	//妻财卯木
	//官鬼巳火世　
	//父母未土
	"000110": NewGua64(
		"兑",
		3,
		"金",
		"泽地萃",
		"萃",
		"父母未土",
		"兄弟酉金应",
		"子孙亥水",
		"妻财卯木",
		"官鬼巳火世",
		"父母未土",
	),
	//-----泽山咸--- -----------------------------
	//父母未土应
	//兄弟酉金
	//子孙亥水
	//兄弟申金世
	//官鬼午火
	//父母辰土
	"001110": NewGua64(
		"兑",
		4,
		"金",
		"泽山咸",
		"咸",
		"父母未土应",
		"兄弟酉金",
		"子孙亥水",
		"兄弟申金世",
		"官鬼午火",
		"父母辰土",
	),


	//--------水山蹇-----------------------------
	//子孙子水 　
	//父母戌土  　　　
	//兄弟申金 世 　
	//兄弟申金  　　　
	//官鬼午火 　
	//父母辰土 应 　
	"001010": NewGua64(
		"兑",
		5,
		"金",
		"水山蹇",
		"蹇",
		"子孙子水",
		"父母戌土",
		"兄弟申金世",
		"兄弟申金",
		"官鬼午火",
		"父母辰土应",
	),
	//------6--地山谦 -----------------------------
	//兄弟酉金
	//子孙亥水 世 　
	//父母丑土 　
	//兄弟申金 　
	// 官鬼午火 应 　
	// 父母辰土 　
	"001000": NewGua64(
		"兑",
		6,
		"金",
		"地山谦",
		"谦",
		"兄弟酉金",
		"子孙亥水世",
		"父母丑土",
		"兄弟申金",
		"官鬼午火应",
		"父母辰土",
	),
	//--------7  雷山小过-----------------------------
	//父母戌土
	//兄弟申金
	//官鬼午火 世　　
	//兄弟申金 　　　
	//官鬼午火 　
	//父母辰土  应　

	"001100": NewGua64(
		"兑",
		7,
		"金",
		"雷山小过",
		"小过",
		"父母戌土",
		"兄弟申金",
		"官鬼午火世",
		"兄弟申金",
		"官鬼午火",
		"父母辰土应",
	),
	//--------8  雷泽归妹-----------------------------
	//父母戌土 应
	//兄弟申金
	//官鬼午火
	//父母丑土 世
	//妻财卯木
	//官鬼巳火
	"110100": NewGua64(
		"兑",
		8,
		"金",
		"雷泽归妹",
		"归妹",
		"父母戌土应",
		"兄弟申金",
		"官鬼午火",
		"父母丑土世",
		"妻财卯木",
		"官鬼巳火",
	),

	//--------//离宫八卦属火： -----------------------------
	//--------1 离为火-----------------------------
	//兄弟巳火  世 　
	//子孙未土   　　　
	//妻财酉金   　　
	//官鬼亥水  应　　
	//子孙丑土    　　
	//父母卯木   　　　
	"101101": NewGua64(
		"离",
		1,
		"火",
		"离为火",
		"火",
		"兄弟巳火世",
		"子孙未土",
		"妻财酉金",
		"官鬼亥水应",
		"子孙丑土",
		"父母卯木",
	),
	//--------2 火山旅-----------------------------
	//兄弟巳火   　
	//子孙未土
	//妻财酉金  应　
	//妻财申金  　　
	//兄弟午火   　
	//子孙辰土   世
	"001101": NewGua64(
		"离",
		2,
		"火",
		"火山旅",
		"旅",
		"兄弟巳火",
		"子孙未土",
		"妻财酉金应",
		"妻财申金",
		"兄弟午火",
		"子孙辰土世",
	),
	//----3----火风鼎-----------------------------
	//兄弟巳火 　　　
	//子孙未土  应
	//妻财酉金 　　　
	//妻财酉金 　　　
	//官鬼亥水  世　
	//子孙丑土   　
	"011101": NewGua64(
		"离",
		3,
		"火",
		"火风鼎",
		"鼎",
		"兄弟巳火",
		"子孙未土应",
		"妻财酉金",
		"妻财酉金",
		"官鬼亥水世",
		"子孙丑土",
	),
	//-------- 4 火水未济-----------------------------
	//兄弟巳火  应
	//子孙未土
	//妻财酉金
	//兄弟午火   世
	//子孙辰土
	//父母寅木
	"010101": NewGua64(
		"离",
		4,
		"火",
		"火水未济",
		"未济",
		"兄弟巳火应",
		"子孙未土",
		"妻财酉金",
		"兄弟午火世",
		"子孙辰土",
		"父母寅木",
	),

	//-------- --5---------------------------
	//山水蒙 　　　   　
	// 父母寅木   　　　
	// 官鬼子水    　　
	// 子孙戌土   世 　
	// 兄弟午火    　　
	// 子孙辰土   　　　
	// 父母寅木   应 　
	"010001": NewGua64(
		"离",
		5,
		"火",
		"山水蒙",
		"蒙",
		"父母寅木",
		"官鬼子水",
		"子孙戌土世",
		"兄弟午火",
		"子孙辰土",
		"父母寅木应",
	),
	//--------6 -----------------------------
	// 风水涣　　
	// 　 父母卯木   　
	//   兄弟巳火  世
	//   子孙未土
	//   兄弟午火
	// 　子孙辰土  应
	//   父母寅木
	"010011": NewGua64(
		"离",
		6,
		"火",
		"风水涣",
		"涣",
		"父母卯木",
		"兄弟巳火世",
		"子孙未土",
		"兄弟午火",
		"子孙辰土应",
		"父母寅木",
	),
	//--------7 天水讼-----------------------------
	//子孙戌土 　　　　
	//妻财申金 　　　
	//兄弟午火 世 　
	//兄弟午火   　
	//子孙辰土 　　　　
	//父母寅木  应　
	"010111": NewGua64(
		"离",
		7,
		"火",
		"天水讼",
		"讼",
		"子孙戌土",
		"妻财申金",
		"兄弟午火世",
		"兄弟午火",
		"子孙辰土",
		"父母寅木应",
	),
	//-------8- -----------------------------
	//  　天火同人
	//子孙戌土  应
	//妻财申金
	//兄弟午火
	//官鬼亥水  世
	//子孙丑土
	//父母卯木
	"101111": NewGua64(
		"离",
		8,
		"火",
		"天火同人",
		"同人",
		"子孙戌土应",
		"妻财申金",
		"兄弟午火",
		"官鬼亥水世",
		"子孙丑土",
		"父母卯木",
	),

	//======震==================
	//-----------1------震为雷-----------------　　  　
	//妻财戌土 世 　
	//官鬼申金  　　
	//子孙午火  　　　
	//妻财辰土 应 　
	//兄弟寅木  　　
	//父母子水  　　　
	"100100": NewGua64(
		"震",
		1,
		"木",
		"震为雷",
		"雷",
		"妻财戌土世",
		"官鬼申金",
		"子孙午火",
		"妻财辰土应",
		"兄弟寅木",
		"父母子水",
	),
	//----------2-------雷地豫y-----------------
	// 妻财戌土  　
	//官鬼申金  　　
	//　子孙午火 应
	// 兄弟卯木  　
	//子孙巳火  　
	//　妻财未土 世
	"000100": NewGua64(
		"震",
		2,
		"木",
		"雷地豫",
		"豫",
		"妻财戌土",
		"官鬼申金",
		"子孙午火应",
		"兄弟卯木",
		"子孙巳火",
		"妻财未土世",
	),

	//----------3-------雷水解xiè-----------------
	//　 妻财戌土 　　
	// 官鬼申金 应　
	//　　 子孙午火　　
	//　 子孙午火　　
	//　妻财辰土 世　　
	//　 兄弟寅木 　
	"010100": NewGua64(
		"震",
		3,
		"木",
		"雷水解",
		"解",
		"妻财戌土",
		"官鬼申金应",
		"子孙午火",
		"子孙午火",
		"妻财辰土世",
		"兄弟寅木",
	),

	//----------4-------雷风恒-----------------
	//妻财戌土 应
	//官鬼申金
	//子孙午火
	//官鬼酉金 世
	//父母亥水
	//妻财丑土
	"011100": NewGua64(
		"震",
		4,
		"木",
		"雷风恒",
		"恒",
		"妻财戌土应",
		"官鬼申金",
		"子孙午火",
		"官鬼酉金世",
		"父母亥水",
		"妻财丑土",
	),

	//------5----地风升---------- 　　　　
	//     官鬼酉金
	//     父母亥水  　
	//     妻财丑土 世　
	//     官鬼酉金  　
	//     父母亥水  　
	//     妻财丑土 应
	"011000": NewGua64(
		"震",
		5,
		"木",
		"地风升",
		"升",
		"官鬼酉金",
		"父母亥水",
		"妻财丑土世",
		"官鬼酉金",
		"父母亥水",
		"妻财丑土应",
	),

	//------6-----水风井----------- 　
	//父母子水  　
	//妻财戌土 世
	//官鬼申金  　
	//官鬼酉金  　
	//父母亥水 应
	//妻财丑土  　
	"011010": NewGua64(
		"震",
		6,
		"木",
		"水风井",
		"井",
		"父母子水",
		"妻财戌土世",
		"官鬼申金",
		"官鬼酉金",
		"父母亥水应",
		"妻财丑土",
	),

	//-------7---泽风大过----------　   　
	//妻财未土 　　
	//官鬼酉金　　　
	//父母亥水 世　　
	//官鬼酉金　　　
	//父母亥水　　　
	//妻财丑土 应　　
	"011110": NewGua64(
		"震",
		7,
		"木",
		"泽风大过",
		"大过",
		"妻财未土",
		"官鬼酉金",
		"父母亥水世",
		"官鬼酉金",
		"父母亥水",
		"妻财丑土应",
	),

	//------8----泽雷随suí----------
	//妻财未土 应
	//官鬼酉金
	//父母亥水
	//妻财辰土 世
	//兄弟寅木
	//父母子水
	"100110": NewGua64(
		"震",
		8,
		"木",
		"泽雷随",
		"随",
		"妻财未土应",
		"官鬼酉金",
		"父母亥水",
		"妻财辰土世",
		"兄弟寅木",
		"父母子水",
	),
	//=========//巽xùn宫八卦属木：===============================
	//----1----- 巽为风　　---------
	//兄弟卯木世
	//子孙巳火
	//妻财未土
	//官鬼酉金应
	//父母亥水
	//妻财丑土
	"011011": NewGua64(
		"巽",
		1,
		"木",
		"巽为风",
		"风",
		"兄弟卯木世",
		"子孙巳火",
		"妻财未土",
		"官鬼酉金应",
		"父母亥水",
		"妻财丑土",
	),

	//-----2----风天小畜---------
	//兄弟卯木 　
	//子孙巳火 　
	//妻财未土应 　
	//妻财辰土
	//兄弟寅木 　
	//父母子水世　
	"111011": NewGua64(
		"巽",
		2,
		"木",
		"风天小畜",
		"小畜",
		"兄弟卯木",
		"子孙巳火",
		"妻财未土应",
		"妻财辰土",
		"兄弟寅木",
		"父母子水世",
	),

	//------3---风火家人---------
	//兄弟卯木　　　
	//子孙巳火应　　
	//妻财未土
	//父母亥水　　
	//妻财丑土世　
	//兄弟卯木　　　　
	"101011": NewGua64(
		"巽",
		3,
		"木",
		"风火家人",
		"家人",
		"兄弟卯木",
		"子孙巳火应",
		"妻财未土",
		"父母亥水",
		"妻财丑土世",
		"兄弟卯木",
	),

	//------4---风雷益---------
	//兄弟卯木应
	//子孙巳火
	//妻财未土
	//妻财辰土世
	//兄弟寅木
	//父母子水
	"100011": NewGua64(
		"巽",
		4,
		"木",
		"风雷益",
		"益",
		"兄弟卯木应",
		"子孙巳火",
		"妻财未土",
		"妻财辰土世",
		"兄弟寅木",
		"父母子水",
	),

	//------5---天雷无妄---------　
	//妻财戌土  　　　
	//官鬼申金  　　
	//子孙午火世 　
	//妻财辰土  　　
	//兄弟寅木  　　
	//父母子水应 　
	"100111": NewGua64(
		"巽",
		5,
		"木",
		"天雷无妄",
		"无妄",
		"妻财戌土",
		"官鬼申金",
		"子孙午火世",
		"妻财辰土",
		"兄弟寅木",
		"父母子水应",
	),

	//------6---火雷噬嗑---------
	//子孙巳火  　
	//妻财未土世　
	//官鬼酉金  　
	//妻财辰土  　　
	//兄弟寅木应 　
	//父母子水  　
	"100101": NewGua64(
		"巽",
		6,
		"木",
		"火雷噬嗑",
		"噬嗑",
		"子孙巳火",
		"妻财未土世",
		"官鬼酉金",
		"妻财辰土",
		"兄弟寅木应",
		"父母子水",
	),

	//-----7----山雷颐---------
	//兄弟寅木　　
	//父母子水　 　
	//妻财戌土世　
	//妻财辰土 　　
	//兄弟寅木 　　
	//父母子水应　
	"100001": NewGua64(
		"巽",
		7,
		"木",
		"山雷颐",
		"颐",
		"兄弟寅木",
		"父母子水",
		"妻财戌土世",
		"妻财辰土",
		"兄弟寅木",
		"父母子水应",
	),
	//-----8----山风蛊---------
	//兄弟寅木应
	//父母子水
	//妻财戌土
	//官鬼酉金世
	//父母亥水
	//妻财丑土
	"011001": NewGua64(
		"巽",
		8,
		"木",
		"山风蛊",
		"蛊",
		"兄弟寅木应",
		"父母子水",
		"妻财戌土",
		"官鬼酉金世",
		"父母亥水",
		"妻财丑土",
	),

	//=========//坎宫八卦属水：================================
	//---------1--- 坎为水　　　------------
	//兄弟子水世
	//官鬼戌土  　
	//父母申金  　
	//妻财午火应
	//官鬼辰土  　
	//子孙寅木  　
	"010010": NewGua64(
		"坎",
		1,
		"水",
		"坎为水",
		"坎",
		"兄弟子水世",
		"官鬼戌土",
		"父母申金",
		"妻财午火应",
		"官鬼辰土",
		"子孙寅木",
	),

	//-------2-----水泽节------------
	//兄弟子水 　
	//官鬼戌土
	//父母申金应
	//官鬼丑土 　
	//子孙卯木
	//妻财巳火世
	"110010": NewGua64(
		"坎",
		2,
		"水",
		"水泽节",
		"节",
		"兄弟子水",
		"官鬼戌土",
		"父母申金应",
		"官鬼丑土",
		"子孙卯木",
		"妻财巳火世",
	),

	//--------3----水雷屯------------
	//兄弟子水 　　
	//官鬼戌土应　
	//父母申金 　 　
	//官鬼辰土 　　
	//子孙寅木世　
	//兄弟子水　　　
	"100010": NewGua64(
		"坎",
		3,
		"水",
		"水雷屯",
		"屯",
		"兄弟子水",
		"官鬼戌土应",
		"父母申金",
		"官鬼辰土",
		"子孙寅木世",
		"兄弟子水",
	),

	//---------4---水火既济---4---------
	//兄弟子水应
	//官鬼戌土
	//父母申金
	//兄弟亥水世
	//官鬼丑土
	//子孙卯木
	"101010": NewGua64(
		"坎",
		4,
		"水",
		"水火既济",
		"既济",
		"兄弟子水应",
		"官鬼戌土",
		"父母申金",
		"兄弟亥水世",
		"官鬼丑土",
		"子孙卯木",
	),

	//----5---泽火革------- 　　　
	//官鬼未土  　
	//父母酉金  　
	//兄弟亥水世
	//兄弟亥水  　　
	//官鬼丑土  　　
	//子孙卯木应 　
	"101110": NewGua64(
		"坎",
		5,
		"水",
		"泽火革",
		"革",
		"官鬼未土",
		"父母酉金",
		"兄弟亥水世",
		"兄弟亥水",
		"官鬼丑土",
		"子孙卯木应",
	),

	//----6---雷火丰-------
	//官鬼戌土  　　
	//父母申金世
	//妻财午火  　
	//兄弟亥水  　
	//官鬼丑土应
	//子孙卯木  　
	"101100": NewGua64(
		"坎",
		6,
		"水",
		"雷火丰",
		"丰",
		"官鬼戌土",
		"父母申金世",
		"妻财午火",
		"兄弟亥水",
		"官鬼丑土应",
		"子孙卯木",
	),

	//-----7--地火明夷-------
	//父母酉金 　　
	//兄弟亥水 　　
	//官鬼丑土世　
	//弟亥水　　
	//官鬼丑土 　　
	//子孙卯木应　
	"101000": NewGua64(
		"坎",
		7,
		"水",
		"地火明夷",
		"明夷",
		"父母酉金",
		"兄弟亥水",
		"官鬼丑土世",
		"弟亥水",
		"官鬼丑土",
		"子孙卯木应",
	),

	//----8---地水师-------
	//父母酉金应
	//兄弟亥水
	//官鬼丑土
	//妻财午火世
	//官鬼辰土
	//子孙寅木
	"010000": NewGua64(
		"坎",
		8,
		"水",
		"地水师",
		"师",
		"父母酉金应",
		"兄弟亥水",
		"官鬼丑土",
		"妻财午火世",
		"官鬼辰土",
		"子孙寅木",
	),

	//==================================
	//--------艮宫八卦属土：-------------------------------
	//-------1----艮为山---------
	//官鬼寅木世
	//妻财子水  　
	//兄弟戌土
	//子孙申金应　　
	//父母午火  　
	//兄弟辰土  　
	"001001": NewGua64(
		"艮",
		1,
		"土",
		"艮为山",
		"艮为山",
		"官鬼寅木世",
		"妻财子水",
		"兄弟戌土",
		"子孙申金应",
		"父母午火",
		"兄弟辰土",
	),

	//------2---山火贲bì---------
	//官鬼寅木  　
	//妻财子水 　　
	//兄弟戌土应
	//妻财亥水  　　
	//兄弟丑土  　
	//官鬼卯木世
	"101001": NewGua64(
		"艮",
		2,
		"土",
		"山火贲",
		"贲",
		"官鬼寅木",
		"妻财子水",
		"兄弟戌土应",
		"妻财亥水",
		"兄弟丑土",
		"官鬼卯木世",
	),

	//------3---山天大蓄---------
	//官鬼寅木　　　　
	//妻财子水应　
	//兄弟戌土 　
	//兄弟辰土　　　
	//官鬼寅木世
	//妻财子水　　
	"111001": NewGua64(
		"艮",
		3,
		"土",
		"山天大蓄",
		"大蓄",
		"官鬼寅木",
		"妻财子水应",
		"兄弟戌土",
		"兄弟辰土",
		"官鬼寅木世",
		"妻财子水",
	),

	//-----4----山泽损---------
	//官鬼寅木应
	//妻财子水
	//兄弟戌土
	//兄弟丑土世
	//官鬼卯木
	//父母巳火
	"110001": NewGua64(
		"艮",
		4,
		"土",
		"山泽损",
		"损",
		"官鬼寅木应",
		"妻财子水",
		"兄弟戌土",
		"兄弟丑土世",
		"官鬼卯木",
		"父母巳火",
	),

	//-----5----火泽睽kuí---------
	//父母巳火  　
	//兄弟未土  　
	//子孙酉金世 　
	//兄弟丑土  　　
	//官鬼卯木  　　
	//父母巳火应 　
	"110101": NewGua64(
		"艮",
		5,
		"土",
		"火泽睽",
		"睽",
		"父母巳火",
		"兄弟未土",
		"子孙酉金世",
		"兄弟丑土",
		"官鬼卯木",
		"父母巳火应",
	),

	//-----6----天泽履---------
	//兄弟戌土  　
	//子孙申金世 　
	//父母午火  　
	//兄弟丑土  　
	//官鬼卯木应
	//父母巳火  　
	"110111": NewGua64(
		"艮",
		6,
		"土",
		"天泽履",
		"履",
		"兄弟戌土",
		"子孙申金世",
		"父母午火",
		"兄弟丑土",
		"官鬼卯木应",
		"父母巳火",
	),

	//------7---风泽中孚f---------
	//官鬼卯木　　　
	//父母巳火　　　　
	//兄弟未土世　　
	//兄弟丑土 　　
	//官鬼卯木　　　
	//父母巳火应　　
	"110011": NewGua64(
		"艮",
		7,
		"土",
		"风泽中孚",
		"中孚",
		"官鬼卯木",
		"父母巳火",
		"兄弟未土世",
		"兄弟丑土",
		"官鬼卯木",
		"父母巳火应",
	),

	//-----8----风山渐---------
	//官鬼卯木应
	//父母巳火
	//兄弟未土
	//子孙申金世
	//父母午火
	//兄弟辰土
	"001011": NewGua64(
		"艮",
		8,
		"土",
		"风山渐",
		"渐",
		"官鬼卯木应",
		"父母巳火",
		"兄弟未土",
		"子孙申金世",
		"父母午火",
		"兄弟辰土",
	),

	//=====================================
	//-------1---坤为地----------　　　
	//子孙酉金世
	//妻财亥水  　
	//兄弟丑土  　
	//官鬼卯木应
	//父母巳火  　
	//兄弟未土  　
	"000000": NewGua64(
		"坤",
		1,
		"土",
		"坤为地",
		"坤为地",
		"子孙酉金世",
		"妻财亥水",
		"兄弟丑土",
		"官鬼卯木应",
		"父母巳火",
		"兄弟未土",
	),

	//---2-------地雷复----------
	//子孙酉金 　
	//妻财亥水 　
	//兄弟丑土应
	//兄弟辰土
	//官鬼寅木 　
	//妻财子水世
	"100000": NewGua64(
		"坤",
		2,
		"土",
		"地雷复",
		"复",
		"子孙酉金",
		"妻财亥水",
		"兄弟丑土应",
		"兄弟辰土",
		"官鬼寅木",
		"妻财子水世",
	),

	//-------3---地泽临----------
	//子孙酉金
	//妻财亥水应
	//兄弟丑土 　　
	//兄弟丑土　　
	//官鬼卯木世
	//父母巳火　　
	"110000": NewGua64(
		"坤",
		3,
		"土",
		"地泽临",
		"临",
		"子孙酉金",
		"妻财亥水应",
		"兄弟丑土",
		"兄弟丑土",
		"官鬼卯木世",
		"父母巳火",
	),

	//------4----地天泰----------
	//子孙酉金应
	//妻财亥水　
	//兄弟丑土　
	//兄弟辰土世
	//官鬼寅木　
	//妻财子水
	"111000": NewGua64(
		"坤",
		4,
		"土",
		"地天泰",
		"泰",
		"子孙酉金应",
		"妻财亥水",
		"兄弟丑土",
		"兄弟辰土世",
		"官鬼寅木",
		"妻财子水",
	),

	//--5--雷天大壮-----
	//兄弟戌土  　　
	//子孙申金  　　
	//父母午火世 　
	//兄弟辰土  　　
	//官鬼寅木  　　
	//妻财子水应 　
	"111100": NewGua64(
		"坤",
		5,
		"土",
		"雷天大壮",
		"大壮",
		"兄弟戌土",
		"子孙申金",
		"父母午火世",
		"兄弟辰土",
		"官鬼寅木",
		"妻财子水应",
	),

	//---6--泽天夬-----
	//兄弟未土  　
	//子孙酉金世
	//妻财亥水  　
	//兄弟辰土  　
	//官鬼寅木应
	//妻财子水
	"111110": NewGua64(
		"坤",
		6,
		"土",
		"泽天夬",
		"夬",
		"兄弟未土",
		"子孙酉金世",
		"妻财亥水",
		"兄弟辰土",
		"官鬼寅木应",
		"妻财子水",
	),

	//---7--水天需-----
	//妻财子水 　
	//兄弟戌土　　　
	//子孙申金世 　
	//兄弟辰土　　　
	//官鬼寅木　　　
	//妻财子水应　　
	"111010": NewGua64(
		"坤",
		7,
		"土",
		"水天需",
		"需",
		"妻财子水",
		"兄弟戌土",
		"子孙申金世",
		"兄弟辰土",
		"官鬼寅木",
		"妻财子水应",
	),

	//---8--水地比-----
	//妻财子水应
	//兄弟戌土
	//子孙申金
	//官鬼卯木世
	//父母巳火
	//兄弟未土
	"000010": NewGua64(
		"坤",
		8,
		"土",
		"水地比",
		"比",
		"妻财子水应",
		"兄弟戌土",
		"子孙申金",
		"官鬼卯木世",
		"父母巳火",
		"兄弟未土",
	),
}

//-------------坤宫八卦属土----------

func GetG64(code string) *Gua64 {
	g, ok := G64[code]
	if ok {
		return g
	}
	return nil
}
